<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"fbdffe37e6dcb8ce9b9b187f30dc12eb8bd10afc708b76991a55278a2e517fd0","plan_job_ref":"Job .github/workflows/terraform-plan.yml #43 at https://github.com/GradientFlow-ai/terraform/actions/runs/4590732239","plan_hash":"4eba34a455a6cccc241b74593ea24baa08e0fae02ca250a278937fe74ee4f38f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __.__<details open><summary>With variables</summary>

```hcl
TF_VAR_AWS_ACCESS_KEY_ID     = ""
TF_VAR_AWS_SECRET_ACCESS_KEY = ""
TF_VAR_VERCEL_API_TOKEN      = "hbk84kOG3lWDysRodIjnV3Mb"
```
</details>
<details>
<summary>Plan: 3 to add, 4 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos.github_actions_secret.secrets_manager_id will be created
  + resource "github_actions_secret" "secrets_manager_id" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "terraform"
      + secret_name = "AWS_MANAGER_ID"
      + updated_at  = (known after apply)
    }

  # module.repos.github_actions_secret.secrets_manager_key will be created
  + resource "github_actions_secret" "secrets_manager_key" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "terraform"
      + secret_name = "AWS_MANAGER_KEY"
      + updated_at  = (known after apply)
    }

  # module.repos.github_branch_protection.eaas will be updated in-place
  ~ resource "github_branch_protection" "eaas" {
        id                              = "BPR_kwDOI7EyTc4CIwZR"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.embeddings_api will be updated in-place
  ~ resource "github_branch_protection" "embeddings_api" {
        id                              = "BPR_kwDOI-ZWE84CIwg4"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.fast-api-ocean will be updated in-place
  ~ resource "github_branch_protection" "fast-api-ocean" {
        id                              = "BPR_kwDOI96H_s4CIwg3"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.terraform will be updated in-place
  ~ resource "github_branch_protection" "terraform" {
        id                              = "BPR_kwDOJOQLq84CJzKa"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.vercel.vercel_project_environment_variable.NEXTAUTH_URL will be created
  + resource "vercel_project_environment_variable" "NEXTAUTH_URL" {
      + id         = (known after apply)
      + key        = "NEXTAUTH_URL"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [.github/workflows/terraform-plan.yml #43](https://github.com/GradientFlow-ai/terraform/actions/runs/4590732239)